<a href="https://colab.research.google.com/github/Asingh1248/Python-DataScience/blob/master/PythonPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1 ) Pandas Series

# Create a Series

In [ ]:
# pandas series is column in excel sheet

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# 1) Creating pandas series from the list

In [ ]:
my_data = [10,20,30,40,50]
labels = ['a','b','c','d','e']

In [ ]:
pd.Series(data= my_data) # pandas series is like numpy arrays but it has indexes

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
pd.Series(my_data,labels) # There is no need to specify data and index also

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
# 2 ) Panda Series using Numpy Array

In [ ]:
arr = np .array(my_data)
arr

array([10, 20, 30, 40, 50])

In [ ]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [ ]:
#3 ) Panda Series using a Dictionary

In [ ]:
d = {'a':100,'b':200,'c':300}
d

{'a': 100, 'b': 200, 'c': 300}

In [ ]:
pd.Series(d)

a    100
b    200
c    300
dtype: int64

In [ ]:
pd.Series(data=labels) # Pandas can hold any type of data

0    a
1    b
2    c
3    d
4    e
dtype: object

In [ ]:
pd.Series(data = [sum,len])  # Its not used

0    <built-in function sum>
1    <built-in function len>
dtype: object

#Grab info from Panda Series

In [ ]:
seri = pd.Series(data= [1,2,3,4], index=['Red','Green','Blue','Orange'])

In [ ]:
seri

Red       1
Green     2
Blue      3
Orange    4
dtype: int64

In [ ]:
seri2 = pd.Series(data= [1,2,5,4], index=['Red','Green','Orange','Blue'])

In [ ]:
seri2

Red       1
Green     2
Orange    5
Blue      4
dtype: int64

In [ ]:
seri2['Green']

2

In [ ]:
seri['Blue']

3

In [ ]:
# seri3 = Try to access using location , Also indexing

In [ ]:
seri

Red       1
Green     2
Blue      3
Orange    4
dtype: int64

In [ ]:
seri2

Red       1
Green     2
Orange    5
Blue      4
dtype: int64

In [ ]:
seri+ seri2 # Add two series index is sorted in alphabetically order

Blue      7
Green     4
Orange    9
Red       2
dtype: int64

# 2 ) Data Frames

# DataFrames Part1

In [ ]:
import numpy as np  
import pandas as pd
from numpy.random import randn    
np.random.seed(101)  #Ensure that it will have the same output

In [ ]:
df = pd.DataFrame(data=randn(5,4),index=['a','b','c','d','e'],columns=['w','x','y','z'])

In [ ]:
df #Each of the series in column w is numpy series and all these share same index

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [ ]:
#data frame is bunch of pandas series that share some index

In [ ]:
#1 ) Indexing and Selection

In [ ]:
df['w']

In [ ]:
type(df['w'])

pandas.core.series.Series

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df

In [ ]:
df[['w','x','y']] # Bunch of numpy series

In [ ]:
type(df[['w','x','y']]) #

pandas.core.frame.DataFrame

In [ ]:
# 2 ) Add the new column

In [ ]:
df

In [ ]:
df['new']=df['w'] + df['x'] # new is addition of two columns w and x

In [ ]:
df

In [ ]:
#3 ) Remove the columns and rows

In [ ]:
df.drop(labels='new',axis =1)

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [ ]:
df # in original column new column is not removed

In [ ]:
df['new']=df['w'] + df['x'] # Because df changes automatically hence always check it

In [ ]:
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119  1.996388
b -0.134841  0.390528  0.166905  0.184502  0.255687
c  0.807706  0.072960  0.638787  0.329646  0.880666
d -0.497104 -0.754070 -0.943406  0.484752 -1.251174
e -0.116773  1.901755  0.238127  1.996652  1.784981

In [ ]:
df.drop(labels='new',axis =1,inplace=True)

In [ ]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [ ]:
# Try to Delete the row in DataFrame

In [ ]:
#4 ) Selecing the rows in dataframe

In [ ]:
df

In [ ]:
df.loc['c']

In [ ]:
type(df.loc['c'])

pandas.core.series.Series

In [ ]:
# 5 ) selecting the subset of rows and columns

In [ ]:
df

In [ ]:
df.loc['c','x']

0.07295967531703869

In [ ]:
df.loc[['d','e'],['y','z']]

          y         z
d -0.943406  0.484752
e  0.238127  1.996652

# DataFrames Part  2

In [ ]:
import numpy as np  
import pandas as pd
from numpy.random import randn    
np.random.seed(101)  #Ensure that it will have the same output

In [ ]:
df = pd.DataFrame(data=randn(5,4),index=["a","b","c","d","e"],columns=["w","x","y","z"])

In [ ]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
#1) Conditional Selection

In [ ]:
df > 0

In [ ]:
b= df > 0

In [ ]:
b

In [ ]:
df[b]  # Only True values are shown

In [ ]:
df[df>0]

In [ ]:
df['w']>0

In [ ]:
d = df['w']>0

In [ ]:
d

In [ ]:
df[d] # Third row is not seen since is condition is False

In [ ]:
df[df['w']>0]

In [ ]:
#2 ) multipke conditions

In [ ]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[(df['w']>0) & (df['y']>1)] # and operator only single row satisfies these two conditions

In [ ]:
df[(df['w']>0) | (df['y']>1)]

In [ ]:
#3 ) index

In [ ]:
df

In [ ]:
df.reset_index()  # permanent save ke liey inpcae =TRUE

In [ ]:
new_index = ['R','G','B','O','Y']

In [ ]:
new_index

In [ ]:
df['Colors'] = new_index

In [ ]:
df

In [ ]:
df.set_index('Colors')

               w         x         y         z
Colors
R       2.706850  0.628133  0.907969  0.503826
G       0.651118 -0.319318 -0.848077  0.605965
B      -2.018168  0.740122  0.528813 -0.589001
O       0.188695 -0.758872 -0.933237  0.955057
Y       0.190794  1.978757  2.605967  0.683509

# DataFrames Part 3

In [ ]:
# Multi-index and index hierarchy

In [ ]:
# Multi-index is excel lke index we have refined tabular format

In [ ]:
import numpy as np  
import pandas as pd
from numpy.random import randn    
np.random.seed(101)  #Ensure that it will have the same output

In [ ]:
outside = ['Red','Red','Red','Green','Green','Green']
inside = [1,2,3,1,2,3]

In [ ]:
hier_index = list(zip(outside,inside))

In [ ]:
hier_index

[('Red', 1), ('Red', 2), ('Red', 3), ('Green', 1), ('Green', 2), ('Green', 3)]

In [ ]:
multi_index = pd.MultiIndex.from_tuples(hier_index,names=['Colors','Numbers'])

In [ ]:
multi_index

In [ ]:
df= pd.DataFrame(data=randn(6,2),index = multi_index,columns=['A','B'])

In [ ]:
df

                       A         B
Colors Numbers
Red    1       -0.134841  0.390528
       2        0.166905  0.184502
       3        0.807706  0.072960
Green  1        0.638787  0.329646
       2       -0.497104 -0.754070
       3       -0.943406  0.484752

In [ ]:
df.loc['Red'].loc[1]['A']

In [ ]:
# try one more example

In [ ]:
df.index.names

FrozenList(['Colors', 'Numbers'])

In [ ]:
df.index.names = ['Col','Num']

In [ ]:
df

                  A         B
Col   Num
Red   1   -0.134841  0.390528
      2    0.166905  0.184502
      3    0.807706  0.072960
Green 1    0.638787  0.329646
      2   -0.497104 -0.754070
      3   -0.943406  0.484752

In [ ]:
# cross section

In [ ]:
df.loc['Red']

            A         B
Num
1   -0.134841  0.390528
2    0.166905  0.184502
3    0.807706  0.072960

In [ ]:
df.xs('Red') # Provides the ability to go in inside multi level index

In [ ]:
df.xs(key=1,level='Num')  # key = 1 (index Red and Green)

              A         B
Col
Red   -0.134841  0.390528
Green  0.638787  0.329646

# 3 ) Missing Data

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
d= {'A':[1,2,np.NaN],'B':[3,np.NaN,np.NaN],'C':[4,5,5]}

In [ ]:
d

{'A': [1, 2, nan], 'B': [3, nan, nan], 'C': [4, 5, 5]}

In [ ]:
df = pd.DataFrame(d)

In [ ]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  5

In [ ]:
# dropna method

In [ ]:
df.dropna() # deault axis = 0 hence all rows Nan is dropped

     A    B  C
0  1.0  3.0  4

In [ ]:
df.dropna(axis=1)

In [ ]:
df.dropna(thresh=2) #Atleast two Nan in a row #Try with Column

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [ ]:
df.dropna(thresh=1,axis =1)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  5

In [ ]:
#filena method

In [ ]:
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  5

In [ ]:
df.fillna(value='New Value') # Replacing Nan with some string

In [ ]:
df['A'].fillna(value=df['A'].mean()) #Replace the Null values

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# 4) Groupby Method

In [ ]:
# Allows together rows based on columns

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
team_data = {'Company': ['Apple','Apple','FB','FB','Google','Google'],
             'Person': ['Mark','Tom','John','Sara','Mia','Emma'],
             'Sales':[200,150,350,125,250,180]
             }

In [ ]:
df= pd.DataFrame(team_data)

In [ ]:
df

  Company Person  Sales
0   Apple   Mark    200
1   Apple    Tom    150
2      FB   John    350
3      FB   Sara    125
4  Google    Mia    250
5  Google   Emma    180

In [ ]:
df.groupby(by='Company')

In [ ]:
b=df.groupby(by='Company')

In [ ]:
b.mean() # Aggregate Function

         Sales
Company
Apple    175.0
FB       237.5
Google   215.0

In [ ]:
b.sum()

In [ ]:
b.sum().loc['Apple']

Sales    350
Name: Apple, dtype: int64

In [ ]:
df.groupby(by='Company').sum().loc['FB']

Sales    475
Name: FB, dtype: int64

In [ ]:
# Try with count ,max ,

In [ ]:
# groupby method with describe function (Displays all the Aggregate)

In [ ]:
df.groupby(by='Company').describe()

In [ ]:
df.groupby(by='Company').describe().transpose()

In [ ]:
df.groupby(by='Company').describe().loc['FB']

# 5) Merging, Joining and Concatenating

In [3]:
import pandas as pd

# i) DataFrames Concatenation

In [8]:
df1= pd.DataFrame({'A':['A0','A1','A2','A3'],
       'B':['B0','B1','B2','B3'],
       'C':['C0','C1','C2','C3'],
       'D':['D0','D1','D2','D3']},
       index = [0, 1, 2, 3])

df2= pd.DataFrame({'A':['A4','A5','A6','A7'],
       'B':['B4','B5','B6','B7'],
       'C':['C4','C5','C6','C7'],
       'D':['D4','D5','D6','D7']},
       index = [4, 5, 6, 7])

df3= pd.DataFrame({'A':['A8','A9','A10','A11'],
       'B':['B8','B9','B10','B11'],
       'C':['C8','C9','C10','C11'],
       'D':['D8','D9','D10','D11']},
       index = [8, 9, 10, 11])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

In [ ]:
pd.concat(objs=(df1,df2,df3))

In [ ]:
# While Appyling the concatenation first check values otherwise we will get the NaN values

In [ ]:
pd.concat(objs=(df1,df2,df3),axis=1) # First 4 Columns for df1 , 2nd Column for  df2 , last four columns for df 3

# ii) DataFrames Merging

In [14]:
df4 = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'] 
                    })

df5 = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3'] 
                    })

In [ ]:
df4

In [ ]:
df5

In [ ]:
pd.merge(left=df4,right=df5,on='Key') #we are merging on basis Key

In [ ]:
# Try with another example with df6 ,df7  on =['key1','key2']

# iii) DataFrames Join

In [19]:
df8= pd.DataFrame({'A':['A0','A1','A2','A3'],
       'B':['B0','B1','B2','B3']},
       index=['K0','K1','K2','K3'])

df9= pd.DataFrame({'C':['C0','C1','C2','C3'],
       'D':['D0','D1','D2','D3']},
       index=['K0','K1','K2','K3'])

In [20]:
df8

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [ ]:
df9

In [ ]:
# Joing is covenient method for combining the column into single one

In [ ]:
df8.join(df9) # index should common C and D columns are join with A and B

# 6) Pandas Operations

In [23]:
import numpy as np
import pandas as pd

In [27]:
d = {'col1':[1,2,3,4],
     'col2':[45,55,65,45],
     'col3':['asd','jkl','que','xyz']
     }

In [29]:
df = pd.DataFrame(d)
df

   col1  col2 col3
0     1    45  asd
1     2    55  jkl
2     3    65  que
3     4    45  xyz

In [30]:
df['col2'].unique()   # Unique + Nunique Method

array([45, 55, 65])

In [31]:
len(df['col2'].unique())

3

In [32]:
df['col2'].nunique() # No of Uniques Values

3

In [33]:
df['col2'].value_counts() # Value_Counts

45    2
55    1
65    1
Name: col2, dtype: int64

In [ ]:
# apply method

In [34]:
def times5(x):
  return x*5

In [35]:
times5(10)

50

In [36]:
df['col1'].sum()

10

In [ ]:
df

In [ ]:
df['col1'].apply(times5) # apply works each memeber of column through function

In [39]:
df['col3'].apply(len) # len of each word in column 3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
# drop method

In [40]:
df.drop('col1',axis=1,inplace=True)

In [41]:
df.columns  # V Imp to get the columns names through the attribute

Index(['col2', 'col3'], dtype='object')

In [42]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
df.sort_values('col2')

   col2 col3
0    45  asd
3    45  xyz
1    55  jkl
2    65  que

In [45]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

# 7) Reading and Writing files in Pandas

In [46]:
import pandas as pd

In [47]:
pwd  # Go to Files Notebook and upload your csv files in it

'/content'

In [ ]:
pd.read_csv('/content/Train.csv')  # Go to Files and for csv Copy Path

In [49]:
b=pd.read_csv('/content/Train.csv')

In [ ]:
b

In [ ]:
# Writing the dataframe in Csv files

In [52]:
d= {'name': ['Sara','Tom','Mark','Vinnny'],
    'number':[22,25,50,30],
    'score':[75,80,85,90]}

In [53]:
df= pd.DataFrame(d)

In [54]:
df

     name  number  score
0    Sara      22     75
1     Tom      25     80
2    Mark      50     85
3  Vinnny      30     90

In [55]:
df.to_csv('test_2.csv')  # Refresh the csv files

In [ ]:
pd.read_csv('/content/test_2.csv')  #unwanted column is added

In [ ]:
pd.read_csv('/content/test_2.csv',index_col=0)

# i) Reading and Writing the Excel files

In [ ]:
# Try with excel Sheet1

In [ ]:
pd.read_excel('/content/Sample_Excel_File.xlsx',sheet_name='Sheet1')

In [ ]:
# Writing in excel file to_excel